
SPLITED_SOURCE_MAP = {
    "dmg": "城主指南",
    "phb": "玩家手册",
    "tce": "塔莎的万事坩埚",
    "scag": "剑湾冒险者指南",
    "erlw": "艾伯伦：从终末战争中崛起",
    "ai": "艾奎兹玄有限责任公司",
    "sato": "印记城与外域",
    "mot": "塞洛斯之神话奥德赛",
    "mpmm": "多元宇宙的怪物",
    "bgg": "巨人之荣耀",
    "bam": "布布的星界怪兽展",
    "vrgr": "范·里希腾的鸦阁魔域指南",
    "ftd": "费资本的巨龙宝库",
    "egw": "荒洲探险家指南",
    "ggr": "拉尼卡公会长指南",
    "dsotdq": "龙枪：龙后之影", #缺少数据
    "mtf": "魔邓肯的众敌卷册",#缺少数据
    "mpp": "莫提的位面游记",#缺少数据
    "xge": "珊娜萨的万事指南",
    "scc": "斯翠海文：混沌研习",
    "vgm": "瓦罗怪物指南",
    "bmt": "万象无常书",
    "aag": "星界冒险者指南"
}

SPLITED_DIR_MAP = {
    "phb/background": ["玩家手册/个性与背景"],
    "phb/item": ["玩家手册/装备"],
    "dmg/card": ["城主指南/宝藏/魔法物品/奇物/传说.txt"],
    "dmg/deck": ["城主指南/宝藏/魔法物品/奇物/传说.txt"],
    "dmg/disease": ["城主指南/规则之主/运作游戏/疾病.txt"],
    "dmg/hazard": ["城主指南/冒险之主/环境"],
    "dmg/item": ["城主指南/宝藏/魔法物品"],
    "dmg/itemGroup": ["城主指南/宝藏"],
    "tce/data/1de.json": ["塔莎的万事坩埚/团队赞助者", "塔莎的万事坩埚/团队赞助者.txt"],
    "tce/data/010.json": ["塔莎的万事坩埚/玩家选项"],
    "tce/data/237.json": ["塔莎的万事坩埚/魔法物品", "塔莎的万事坩埚/魔法杂物间.txt"],
    "tce/data/340.json": ["塔莎的万事坩埚/城主工具", "塔莎的万事坩埚/环境灾害.txt"],
    "tce/hazard": ["塔莎的万事坩埚/城主工具/环境灾害"],
    "tce/item": ["塔莎的万事坩埚/魔法物品"],
    "tce/monster": ["塔莎的万事坩埚/魔法物品","塔莎的万事坩埚/玩家选项/职业"],
}