
# 问题文件夹：万象无常书
BASE_CATEGORY = {
    "items": [
        # 艾伯伦：从终末战争中崛起、城主指南
        "宝藏",
        # 艾伯伦寻路指南
        "魔法物品",
        # 城主指南2024
        "7.宝藏",
        # 荒洲探险家指南
        "荒洲宝藏",
        # 巨人宝藏
        "巨人宝藏",
        # 拉尼卡公会长指南
        "魔法物品详述"
        # 龙枪：龙后之影
        "装备和魔法物品",
        # 珊娜萨的万事指南
        "奖励魔法物品",
        # 玩家手册
        "装备"
    ],
    "bestiary": [
        # 艾伯伦：从终末战争中崛起
        "新伙伴与敌人",
        # 艾奎兹玄有限责任公司
        "怪物",
        # 布布的星界怪兽展
        "布布的星界怪兽展",
        # 第三方、拉尼卡公会长指南
        "生物",
        "图鉴",
        # 范·里希腾的鸦阁魔域指南
        "鸦阁怪物",
        # 费资本的巨龙宝库、怪物图鉴、
        "怪物图鉴",
        # 怪物图鉴2025
        "怪物图鉴2025",
        # 荒洲探险家指南
        "荒洲生物图集",
        # 莫提的位面游记
        "莫提的位面游记",
        # 塞洛斯之神话奥德赛
        "生物图鉴",
        # 瓦罗怪物指南
        "野兽汇总",
        "非玩家角色"
    ],
    "races": [
        # 艾伯伦：从终末战争中崛起、艾伯伦寻路指南
        "种族",
        "艾伯伦的种族",
        # 艾奎兹玄有限责任公司
        "种族-佛丹人",
        # 第三方
        "林地种族",
        # 魔邓肯的众敌卷册
        "玩家可用种族",
        "种族详述",
    ],
    "class": [

        # 第三方
        "子职",
        # 剑湾冒险者指南
        "职业",
        # 拉尼卡公会长指南
        "子职选项",
        # 玩家手册2024
        "角色职业"
    ],
    "backgrounds":
        [
            "背景",
            #剑湾冒险者指南
            "新背景选项",
            ],
    "spells": [
        # 艾奎兹玄有限责任公司
        "新法术",
        "新法术详述",
        # 第三方
        "法术",
        "法术详述",
        # 剑湾冒险者指南
        "戏法",
        "新戏法",
        # 玩家手册
        "魔法"
    ],
    "vehicles": [
        # 艾奎兹玄有限责任公司
        "载具"
    ],
    "feats": [
        "专长"
    ],
    "adventure": ["模组"],
    "variantrules": ["术语汇编"]

}
